Revit 2027 API
BuiltInFailures.DocumentFailures.DUExcessiveRegeneration Property
 Third party updater '[Name]' has caused an infinite loop and its action had to be canceled.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DUExcessiveRegeneration { get; }
Public Shared ReadOnly Property DUExcessiveRegeneration As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DUExcessiveRegeneration {
	FailureDefinitionId^ get ();
}
static member DUExcessiveRegeneration : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DocumentFailures Class
Autodesk.Revit.DB Namespace